frank/backend/views/account/index.php

            'account_number_id',
            'account_name',
            'opening_date',
            [
                'attribute'=>'Balance',
                'label'=>'Баланс',
                'vAlign'=>'middle',
                'width'=>'190px',
                'value'=>function ($model, $key, $index, $widget) {
                    return $balance = findBalance(
                    \common\models\Transaction::find()->where(['recipient' => [$model->account_number_id]])->all(),
                    \common\models\Transaction::find()->where(['account_number' => [$model->account_number_id]])->all());
                },
            ],
---
SELECT * FROM "transaction" WHERE "account_number"=1