frank/frontend/views/deposite/index.php

        </div>
        <?php foreach($accountNumber as $number){ ?>
            <?php
            $profit = \common\models\Transaction::find()->where(['recipient' => [$number['account_number_id']]])->all();
            $decrease = \common\models\Transaction::find()->where(['account_number' => [$number['account_number_id']]])->all();
---
SELECT * FROM "transaction" WHERE "recipient"=422650621
SELECT * FROM "transaction" WHERE "account_number"=422650621