frank/backend/models/Admin.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM "admin" WHERE ("id"=1) AND ("status"=1)