frank/frontend/views/site/index.php

SELECT * FROM "transaction" WHERE "recipient"=586886106
SELECT * FROM "transaction" WHERE "account_number"=586886106
---
        <?php
        foreach ($accountNumber as $account){?>
            <?php
            $profit = \common\models\Transaction::find()->where(['recipient' => [$account['account_number_id']]])->all();
            $decrease = \common\models\Transaction::find()->where(['account_number' => [$account['account_number_id']]])->all();