frank/common/models/Account.php

    public function createAccount()
    {
        $this->account_number_id = $this->setAccountNumber();
        $this->opening_date = $this->setOpeningDate();
        $this->setOpeningDate();
        $this->user_id = Yii::$app->getUser()->getId();
        $this->save();
---
INSERT INTO "account" ("account_name", "user_id", "account_number_id", "opening_date") VALUES ('alls', 4, 342224014, '2018-07-09T04:20:52+00:00') RETURNING "account_number_id"

    public function searchAccount()
    {
        return $this->find()->where('user_id' === Yii::$app->getUser()->getId())->all();
---
SELECT EXISTS(SELECT * FROM "user" WHERE "user"."id"='4')