frank/common/models/Transaction.php

INSERT INTO "transaction" ("transaction_value", "recipient", "comment", "account_number", "date") VALUES (100, 1, 'aaaa', 342224014, '2018-07-09T04:22:14+00:00') RETURNING "transaction_number"
---
    public function createTransaction()
    {
        $this->date = $this->setTransactionDate();
        $this->save();

INSERT INTO "transaction" ("transaction_value", "account_number", "recipient", "date") VALUES (5000, 0, 342224014, '2018-07-09T04:21:48+00:00') RETURNING "transaction_number"
---
    public function deposite($recipient)
    {
        $this->account_number = 0;
        $this->recipient = $recipient;
        $this->date = $this->setTransactionDate();
        $this->save();