frank/common/models/User.php

SELECT * FROM "user" WHERE ("id"=4) AND ("status"=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM "user" WHERE ("username"='Mike') AND ("status"=1)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);