frank/frontend/views/transaction/index.php

SELECT * FROM "transaction" WHERE "recipient"=342224014
SELECT * FROM "transaction" WHERE "account_number"=342224014
---

        <?php foreach($accountNumber as $number){ ?>
            <?php
                $profit = \common\models\Transaction::find()->where(['recipient' => [$number['account_number_id']]])->all();
                $decrease = \common\models\Transaction::find()->where(['account_number' => [$number['account_number_id']]])->all();

SELECT * FROM "account" WHERE "user_id"=1
---
        <?= $form->field($model, 'transaction_value')->textInput(['autofocus' => true, 'placeholder'=>'Сумма перевода',]) ?>
<!--            --><?//= $form->field($model, 'recipient')->textInput(['placeholder'=>'Номер счета получателя',])?>

            <?= $form->field($model, 'recipient')->dropDownList(
                ArrayHelper::map(
                    \common\models\Account::find()->where(['user_id' => [1]])->all(),
                    'account_number_id',
                    'account_name')
            );?>