frank/frontend/views/transaction-history/index.php

SELECT * FROM "transaction" WHERE "account_number"=342224014
SELECT * FROM "account" WHERE "account_number_id"=1
---
        </div>
<!--        --><?php
            foreach($accountNumber as $number){
                foreach (\common\models\Transaction::find()->where(['account_number' => [$number['account_number_id']]])->all() as $name){
                    $comment = ' (адресат: ' . $name['recipient'] . ')';
                    if($name['recipient'] < 100){
                        $comment = ' (адресат: ' . \common\models\Account::find()->where(['account_number_id' => $name['recipient']])->one()->account_name. ')';

SELECT * FROM "transaction" WHERE "recipient"=342224014
---
        </div>
        <?php
        foreach($accountNumber as $number){
            foreach (\common\models\Transaction::find()->where(['recipient' => [$number['account_number_id']]])->all() as $name){