frank/frontend/controllers/DepositeController.php

    public function actionIndex()
    {
        if(!Yii::$app->user->isGuest){
            $model = new Transaction();
            $recipient = Account::find()->where(['account_number_id' => [$_POST['Transaction']['account_number']?? null]])->one();
            $accountNumber = Account::find()->where(['user_id' => [Yii::$app->getUser()->getId()]])->all();
---
SELECT * FROM "account" WHERE "account_number_id"=NULL
SELECT * FROM "account" WHERE "user_id"=3