frank/frontend/controllers/SiteController.php

SELECT * FROM "account" WHERE "user_id"=4
---
    public function actionIndex()
    {
        if(!Yii::$app->user->isGuest){
            $model = new Account();
            $accountNumber = Account::find()->where(['user_id' => [Yii::$app->getUser()->getId()]])->all();