frank/frontend/controllers/TransactionHistoryController.php

    public function actionIndex()
    {
        if(!Yii::$app->user->isGuest){
            $user = Yii::$app->getUser()->getId();
            $model = new Transaction();
            $accountNumber = Account::find()->where(['user_id' => [$user]])->all();
---
SELECT * FROM "account" WHERE "user_id"=4