frank/frontend/controllers/TransactionController.php

SELECT * FROM "account" WHERE "account_number_id"=NULL
SELECT * FROM "account" WHERE "user_id"=4
SELECT * FROM "transaction" WHERE "recipient"=NULL
SELECT * FROM "transaction" WHERE "account_number"=NULL
---
    public function actionIndex()
    {
        if(!Yii::$app->user->isGuest){
            $model = new Transaction();
            $recipient = Account::find()->where(['account_number_id' => [$_POST['Transaction']['recipient']?? null]])->one();
            $accountNumber = Account::find()->where(['user_id' => [Yii::$app->getUser()->getId()]])->all();

            $profit = Transaction::find()->where(['recipient' => [$_POST['checkedAccount'] ?? null]])->all();
            $decrease = Transaction::find()->where(['account_number' => [$_POST['checkedAccount'] ?? null]])->all();