frank/frontend/models/SignupForm.php

INSERT INTO "user" ("username", "email", "password_hash", "status") VALUES ('Nii', 'nii@ma.ru', '$2y$13$1X/HnGTNfC/dopjt1BdwOualOAoG9anlhQpYxYNxSNbjoTdB1wt4e', 1) RETURNING "id"
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        if($user->id === 1){
            $user->id++;
        }
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;