frank/backend/controllers/AdminController.php

    public function actionImport()
    {
        $model = new UploadForm();

        if (Yii::$app->request->isPost) {
            $model->xlsFile = UploadedFile::getInstance($model, 'xlsFile');
            if ($model->upload()) {
                $name = $model->xlsFile->name;

                $data = \moonland\phpexcel\Excel::import('uploads/' . $name, [
                    'setFirstRecordAsKeys' => true, // if you want to set the keys of record column with first record, if it not set, the header with use the alphabet column on excel.
                    'setIndexSheetByName' => true, // set this if your excel data with multiple worksheet, the index of array will be set with the sheet name. If this not set, the index will use numeric.
                    'getOnlySheet' => 'sheet1', // you can set this property if you want to get the specified sheet from the excel data with multiple worksheet.
                ]);

                foreach ($data as $one){
                    $transaction = new Transaction();

                    $checkUnique = Transaction::find()->where([
                        'account_number' => $one['Номер счета отправителя'],
                        'recipient' => $one['Получатель'],
                        'transaction_value' => $one['Сумма'],
                        'date' => $one['Дата'],
                    ])->one();

                    if(!$checkUnique){

                        $checkAccountNumber = Account::find()->where(['account_number_id' => $one['Номер счета отправителя']])->one();
                        $user = User::find()->where(['email' => $one['E-mail отправителя']])->one();
---
SELECT * FROM "transaction" WHERE ("account_number"=0) AND ("recipient"=586886106) AND ("transaction_value"=100) AND ("date"='2018-07-05 18:30:48')
SELECT * FROM "account" WHERE "account_number_id"=0
SELECT * FROM "user" WHERE "email"='corporation@mail.ru'

                            $user->email = $one['E-mail отправителя'];
                            $user->username = $one['Имя пользователя'];
                            $user->password_hash = '$2y$13$M9sbj3Gva0FUTeScRa4TxedjRohFkvlwfZkMGNXjUvRveBCKsIHZG';
                            $user->save();
---
INSERT INTO "user" ("email", "username", "password_hash", "status") VALUES ('newthug@yan.ru', 'New thug', '$2y$13$M9sbj3Gva0FUTeScRa4TxedjRohFkvlwfZkMGNXjUvRveBCKsIHZG', 1) RETURNING "id"

                            $account->account_name = 'unnamed';
                            $account->opening_date = $account->setOpeningDate();
                            $account->user_id = $user['id'];
                            $account->save();
---
INSERT INTO "account" ("account_number_id", "account_name", "opening_date", "user_id") VALUES (586886106, 'unnamed', '2018-07-09T04:24:12+00:00', 2) RETURNING "account_number_id"

                        $transaction->transaction_value = $one['Сумма'];
                        $transaction->date = $one['Дата'];
                        $transaction->comment = $one['Комментарий'];
                        $transaction->save();
---
INSERT INTO "transaction" ("account_number", "recipient", "transaction_value", "date", "comment") VALUES (0, 586886106, 100, '2018-07-05 18:30:48', '(not set)') RETURNING "transaction_number"